<font size="6" face="verdana" color="green">
    <b>Introdução à <b>Linguagem SQL</b></b><br>
    Sintaxe geral da linguagem
    </font>

<br><br>

**Objetivo:** Explorar comandos básicos da linguagem SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Explorar a sintaxe geral da linguagem
   * A caixa dos comandos,
   * Como os símbolos do usuário são compostos,
   * Como separar comandos,
   * Como fazer comentarios.

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [2]:
# Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     
from sqlalchemy import create_engine

# Conectar com um servidor SQL na base Alunos 15 --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:postgres@localhost/alunos15

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<br><br>

----

<br>

## 2. Sintaxe geral

### 2.1 Caixa da letra

SQL não é sensível à caixa da letra.

In [3]:
%%sql
SELECT Current_database();

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('alunos15',)]

In [4]:
%%sql
select current_database();

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('alunos15',)]

In [5]:
%%sql
SELECT CURRENT_DATABASE();

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[('alunos15',)]

<br>

Em geral, uma boa maneira de usar a caixa das letras, para facilitar a leitura, é usar:
  * Palavras reservadas da linguagem em caixa-alta: `CREATE`, `SELECT`, etc.
  * Os símbolos do usuário em minúsculas, com a primeira letra maiúsucula (e alguns caracteres de destaque também).

<br><br>

----

<br>

### 2.2 Composição dos Símbolos do usuário

Os nomes dos objetos criados pelo cliente, tais como `Tabelas`, `Relações`, etc., devem ser compostos por:
  * letras,
  * dígitos,
  * _underscore_.\
O nome não pode começar com um dígito.

Os valores dos atributos podem usar quaisquer caracteres do dicionário sendo usado\
&emsp; &emsp; Nossa base foi criada usando a codificação `UTF8`.\
<small>(Lembra do comando `CREATE DATABASE` que usamos para criar a base)</small>

In [6]:
%%sql
DROP TABLE IF EXISTS exemplo;
CREATE TABLE Exemplo (
    Dado_Um INTEGER,
    Frase TEXT
);
INSERT INTO EXEMPLO VALUES (123, 'aBc');

 * postgresql://postgres:***@localhost/alunos15
Done.
Done.
1 rows affected.

[]

Os nomes dos objetos criados pelos clientes devem respeitar a caixa com que foram armazenados.\
Os "valores" armazenados sempre respeitam a caixa com que foram criados.

Alguns SGBDs reconhecem e armazenam os nomes de objetos como caixa-baixa, a menos que algo diferente seja explictamente solicitado.

In [7]:
%%sql
SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.

[(123, 'aBc')]

Valores literais, colocados entre `' '` e `" "`, são mantidos na caixa indicada.

In [8]:
%%sql
INSERT INTO EXEMPLO VALUES (123, 'São Carlos');
INSERT INTO EXEMPLO VALUES (321, 'ArArAquArA');
INSERT INTO EXEMPLO VALUES (222, 'Jacarepaguá: 🐊 pa 🌊');
SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊')]

Mudanças de linhas e formatação com espaços é irrelevante.

In [9]:
%%sql
INSERT 
    INTO Exemplo
    VALUES (321,
            'São José 
                      dos 
                           Campos'
           );
SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
5 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos')]

Se o valor do atributo tiver um caracter `'`, então ele deve ser codificado usando `''`.

In [10]:
%%sql
INSERT 
    INTO Exemplo
    VALUES (321, 'colocando ''aspas'''
           );
SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
6 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'")]


<br><br>

----

<br>

### 2.3 Separação entre Comandos

Comandos são separados por ` ; `.

In [11]:
%%sql 
INSERT INTO EXEMPLO VALUES (1, 'A'); INSERT INTO EXEMPLO VALUES (2, 'B'); INSERT INTO 
            EXEMPLO VALUES (3, 'C');               SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
1 rows affected.
1 rows affected.
9 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'"),
 (1, 'A'),
 (2, 'B'),
 (3, 'C')]

Quando a string submetida ao servidor tem apenas um comando,\
o separador ` ; ` pode ser omitido.

In [12]:
%%sql
SELECT * 
    FROM Exemplo

 * postgresql://postgres:***@localhost/alunos15
9 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'"),
 (1, 'A'),
 (2, 'B'),
 (3, 'C')]

<br><br>

----

<br>

### 2.4 Cometários

Comentários são indicados por `--`: o restante da linha é comentário.

In [13]:
%%sql
INSERT INTO EXEMPLO   -- Vamos inserir mais um exemplo:
    VALUES (456,      -- este é o primeiro valor
            'Segundo' -- e este é o segundo valor
           );
SELECT * FROM Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
10 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'"),
 (1, 'A'),
 (2, 'B'),
 (3, 'C'),
 (456, 'Segundo')]

Alguns SGBDs aceitam o padrão `/* comentário */`, mas depois do ` /* ` é importante haver um espaço em branco,\
pois alguns símbolos podem ter significado especial para o comentário <small>(tipo um _pragma_)</small>.

In [14]:
%%sql

INSERT INTO EXEMPLO   -- Vamos inserir mais um exemplo:
    VALUES (1232123,  /* este é o primeiro valor
                         o qual corresponde ao primeiro atributo */
            'este é o último exemplo agora' /* e este é o segundo valor */ 
            );
SELECT * FROM /* de qual tabela vamos ler: */ Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
11 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'"),
 (1, 'A'),
 (2, 'B'),
 (3, 'C'),
 (456, 'Segundo'),
 (1232123, 'este é o último exemplo agora')]

Em <img src="Figuras/Postgres.png" width=100>, comentários `\* *\` pode ser aninhados.

In [15]:
%%sql
INSERT INTO EXEMPLO 
    VALUES (99999999, /* Eu disse: 
                                /* vou repetir */ 
                        de novo */
            'este é o último exemplo!!!!'
            );
SELECT * FROM  Exemplo;

 * postgresql://postgres:***@localhost/alunos15
1 rows affected.
12 rows affected.

[(123, 'aBc'),
 (123, 'São Carlos'),
 (321, 'ArArAquArA'),
 (222, 'Jacarepaguá: 🐊 pa 🌊'),
 (321, 'São José \n                      dos \n                           Campos'),
 (321, "colocando 'aspas'"),
 (1, 'A'),
 (2, 'B'),
 (3, 'C'),
 (456, 'Segundo'),
 (1232123, 'este é o último exemplo agora'),
 (99999999, 'este é o último exemplo!!!!')]


<br><br>

----

<br><br>